packages/Webkul/Checkout/src/Cart.php

    public function savePaymentMethod($payment)
    {
        if (! $cart = $this->getCart()) {
            return false;
        }

        if ($cartPayment = $cart->payment) {
            $cartPayment->delete();
        }

        $cartPayment = new CartPayment;

        $cartPayment->method = $payment['method'];
        $cartPayment->cart_id = $cart->id;
        $cartPayment->save();
---
insert into `cart_payment` (`method`, `cart_id`, `updated_at`, `created_at`) values ('mpauthorizenet', 3444, '2025-02-25 20:56:19', '2025-02-25 20:56:19')

    public function calculateItemsTax($orderId=null): void
    {

       // sandeep add code for admin
        if(isset($orderId)){
            $cart = Order::where('id', $orderId)->first();
        }else{
            $cart = $this->getCart();
        }

        if (!$cart) {
            return;
        }


        Event::dispatch('checkout.cart.calculate.items.tax.before', $cart);

        foreach ($cart->items as $item) {

            $taxCategory = $this->taxCategoryRepository->find($item->product->tax_category_id);
---
select * from `products` where `products`.`id` = 147 and `products`.`id` is not null limit 1

            });


            $item->save();
---
update `cart_items` set `tax_percent` = 0, `tax_amount` = 0, `base_tax_amount` = 0, `cart_items`.`updated_at` = '2025-02-25 04:08:25' where `id` = 6381