packages/ACME/paymentProfile/src/Http/Controllers/Admin/OrdersController.php

    public function view($id)
    {
        $agent = agentHandler::where('order_id', $id)->first();
        $countries = Db::table('countries')->get();
        $shipment = $this->shipmentRepository->where('order_id', $id)->first();
        $states = Db::table('country_states')->where('country_code', 'US')->get();
        $order = $this->orderRepository->findOrFail($id);
        $deliver_partner = '';
        if ($shipment) {
            $deliver_partner = Admin::where('id', $shipment->delivery_partner)->first();
        }

        $airport_fbo = DB::table('airport_fbo_details')
            ->where('id', $order->airport_fbo_id)
            ->select('id', 'name', 'address', 'airport_id', 'customer_id')->first();
---
select * from `countries`
select * from `shipments` where `order_id` = '2536' limit 1
select * from `country_states` where `country_code` = 'US'
select * from `admins` where `id` = 4 limit 1
select `id`, `name`, `address`, `airport_id`, `customer_id` from `airport_fbo_details` where `id` = 203 limit 1

    public function update_order_fbo(Request $request, $order_id)
    {

        $dateString = $request->delivery_date;
        // dd($dateString);
        // Check if the requested date is "Today" or "Tomorrow"
        if ($dateString == "Today") {

            $date = new DateTime(); // Set date to today
        } elseif ($dateString == "Tomorrow") {
            $date = new DateTime('+1 day'); // Set date to tomorrow
        } else {
            // Parse the date string
            $date = DateTime::createFromFormat('l n/j', $dateString);
        }

        // Format the date as desired
        $formattedDate = $date->format('Y-n-j');

        DB::table('orders')
            ->where('increment_id', $order_id)
            ->update([
                'fbo_full_name' => $request->fullname,
                'fbo_phone_number' => $request->phonenumber,
                'fbo_email_address' => $request->email,
                'fbo_tail_number' => $request->tailnumber,
                'fbo_packaging' => $request->packagingsection,
                'fbo_service_packaging' => $request->servicePackaging,
                'delivery_date' => $formattedDate,
                'delivery_time' => $request->delivery_time,
            ]);

                // sandeep update quickbook invoice
                $quickbookInvoiceId = DB::table('orders')->where('id',$order_id)->select('quickbook_invoice_id')->first();
---
update `orders` set `fbo_full_name` = 'test tst', `fbo_phone_number` = '(555) 555-55', `fbo_email_address` = 'sandeep@mindwebtree.com', `fbo_tail_number` = '5654', `fbo_packaging` = 'Microwave', `fbo_service_packaging` = 'Bulk Packaging', `delivery_date` = '2025-2-21', `delivery_time` = '6:45 PM' where `increment_id` = '2572'
select `quickbook_invoice_id` from `orders` where `id` = '2572' limit 1