packages/ACME/paymentProfile/src/Http/Controllers/Shop/paymentProfileController.php

insert into `customer_inquerys` (`fname`, `lname`, `email`, `mobile_number`, `message`, `updated_at`, `created_at`) values ('test', 'tst', 'ram@mindwebtree.com', '(098) 977-7678', 'test', '2025-02-28 03:38:08', '2025-02-28 03:38:08')
---
    public function storeinquery(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'fname' => 'required|string|max:25',
            'lname' => 'required|string|max:25',
            'email' => 'required|email',
            'mobile_number' => 'required|regex:/^\(\d{3}\) \d{3}-\d{4}$/',
            'message' => 'required',
            'uploadfile.*' => 'required|mimes:doc,docx,xls,xlsx,pdf|max:2048',
        ], [
            'uploadfile.*.mimes' => 'File must be a type: doc, docx, xls, xlsx, pdf.',
            'uploadfile.*.max' => 'File may not be greater than 2048 kilobytes.',
        ]);

        // for normal form
        if ($validator->fails()) {
            return redirect()->back()
                ->withErrors($validator)
                ->withInput();
        }

        $customers = new CustomerInquery();
        $customers->fname = $request->fname;
        $customers->lname = $request->lname;
        $customers->email = $request->email;
        $customers->mobile_number = $request->mobile_number;
        $customers->message = $request->message;
        $customers->save();

select * from `customer_inquerys` where `customer_inquerys`.`id` = 0 limit 1
---
    public function inquery_thankyou_page(request $request)
    {

        $id = intval($request->getQueryString());

        $inqueryData = CustomerInquery::find($id);