packages/Webkul/Shop/src/Http/Controllers/ProductsCategoriesProxyController.php

select * from `product_categories` where `category_id` in (16, 17)
---
    public function getCategorydetail($categoryId)
    {

        /* fetch category details */
        $categoryDetails = $this->categoryRepository->find($categoryId);
        if (!$categoryDetails) {
            /* if category not found then return empty response */
            return response()->json([
                'products' => [],
                'paginationHTML' => '',
                'product_category' => [],

            ]);
        }

        /* fetching products */
        $products = $this->productRepository->getAll($categoryId);
        $products->withPath($categoryDetails->slug);
        $productCategoryId = array_map('intval', explode(',', $categoryId)); //converted to integer



        return [
            'products' => collect($products->items())->map(function ($product) {
                return $this->velocityHelper->formatProduct($product);
            }),
            'paginationHTML' => $products->appends(request()->input())->links()->toHtml(),
            'product_category' => DB::table('product_categories')
                ->select('*')
                ->whereIn('category_id', $productCategoryId)
                ->get(),

select `category_id` from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` = 147
select `products`.*, `product_categories`.`category_id` as `pivot_category_id`, `product_categories`.`product_id` as `pivot_product_id` from `products` inner join `product_categories` on `products`.`id` = `product_categories`.`product_id` where `product_categories`.`category_id` = 17 limit 4
---
    public function product_info()
    {
        $slugOrPath = request()->input('slug');
        // $slugOrPath = 'sandwich';

        if ($product = $this->productRepository->findBySlug($slugOrPath)) {
            if ($product->visible_individually && $product->url_key && $product->status) {
                $categoryId = $product->categories()->pluck('category_id');
                $viewData = [
                    'product' => $product,
                    'customer' => auth()->guard('customer')->user(),
                ];


                if (isset($categoryId) && count($categoryId) > 0) {
                    $category = $this->categoryRepository->findById($categoryId[0]);
                    $viewData['youMayAlsoLikeIts'] = $category->products()->take(4)->get();