packages/ACME/CateringPackage/src/Http/Controllers/Shop/CateringPackageController.php

select * from `airport_fbo_details` where `airport_id` = '1' and ((`customer_id` is null and `customer_token` is null) or (`customer_token` = 'k4abVK8PwWL0b0QzwCbDAHtyGbAAPkn5bMqDHCvq'))
---
            return $output;
        } elseif ($request->ajax() && $request->type == 'airport_fbo_detail') {

            $airport_fbo_details = DB::table('airport_fbo_details')
                ->where('airport_id', $request->airport_id)
                ->where(function ($query) {
                    $query->where(function ($subquery) {
                        $subquery->whereNull('customer_id')
                            ->whereNull('customer_token');
                    })
                        ->orWhere(function ($subquery) {
                            if (auth()->guard('customer')->check()) {
                                $subquery->Where('customer_id', auth()->guard('customer')->user()->id);
                            } else {
                                $subquery->Where('customer_token', request()->input('_token'));
                            }
                        });
                })
                ->get();

select * from `fbo_details` where `customer_token` = 'k4abVK8PwWL0b0QzwCbDAHtyGbAAPkn5bMqDHCvq' order by `id` desc limit 1
---
                }
                session(['token' => $customer_token]);
            } else {
                $latestRecord = DB::table('fbo_details')
                    ->where('customer_token', $customer_token)
                    ->orderBy('id', 'desc')
                    ->first();

insert into `fbo_details` (`delivery_time`, `delivery_date`, `customer_token`) values ('10:30 PM', '2025-2-25', 'k4abVK8PwWL0b0QzwCbDAHtyGbAAPkn5bMqDHCvq')
---
                            'delivery_date' => $formattedDate,
                        ]);
                } else {
                    DB::table('fbo_details')
                        ->insert([
                            'delivery_time' => $request->time,
                            'delivery_date' => $formattedDate,
                            'customer_token' => $customer_token,
                        ]);

select * from `delivery_location_airports` where `id` = '1' limit 1
select * from `country_states` where `id` = 4 limit 1
---

        if (!isset($request->time_update) && $request->time_update != true && !request()->has('type')) {

            $airport_data = Db::table('delivery_location_airports')->where('id', $request->airport_id)->first();

            $country_states = Db::table('country_states')->where('id', $airport_data->state)->first();

select `customer_token` from `addresses`
insert into `addresses` (`postcode`, `state`, `country`, `address1`, `customer_token`, `airport_name`, `address_type`, `airport_fbo_id`, `created_at`) values (85034, 'AZ', 'US', '3400 E Sky Harbor Blvd, Phoenix, AZ 85034, United States', 'k4abVK8PwWL0b0QzwCbDAHtyGbAAPkn5bMqDHCvq', 'Phoenix Sky Harbor PHX', 'customer', '204', '2025-02-25 22:22:21')
select * from `addresses` where `id` = 11810 limit 1
---

            session(['token' => $request->_token]);

            $addresses = Db::table('addresses')->pluck('customer_token')->toArray();
            if (!in_array($request->customer_token, $addresses)) {

                $addressId = DB::table('addresses')->insertGetId([

                    'postcode' => $airport_data->zipcode,
                    'state' => $country_states->code,
                    'country' => $country_states->country_code,
                    'address1' => $airport_data->address,
                    'customer_token' => $request->customer_token,
                    'airport_name' => $airport_data->name,
                    'address_type' => 'customer',
                    'airport_fbo_id' => $request->input('selected_fbo_id'),
                    'created_at' => now(),
                ]);


                // sandeep get address data
                $airportData = DB::table('addresses')
                    ->where('id', $addressId)
                    ->first();