packages/ACME/CateringPackage/src/Http/Controllers/Shop/CheckoutController.php

select * from `fbo_details` where `customer_token` = 'SaIE1uA7yb0Sqt00aF7cmuL1bHaSHDmhwQtPqRt2' order by `id` desc limit 1
---
        //         ->first();
        // }

        $fboDetails = DB::table('fbo_details')
            ->where($customerId ? 'customer_id' : 'customer_token', $customerId ?: $token)
            ->orderBy('id', 'DESC')
            ->first();

select * from `addresses` where `customer_token` = 'SaIE1uA7yb0Sqt00aF7cmuL1bHaSHDmhwQtPqRt2' and `address_type` = 'customer' and `customer_token` is not null order by `id` desc limit 1
---

        // dd(auth()->check());
        /* GET CUSTOMER ADDRESS*/
        $customer_address = DB::table('addresses')
            ->where(auth()->check() ? 'customer_id' : 'customer_token', auth()->user()->id ?? $token)
            ->where('address_type', 'customer')
            ->whereNotNull('customer_token')
            ->orderBy('id', 'DESC')
            ->first();

select `id` from `delivery_location_airports` where `name` = 'Phoenix Sky Harbor PHX' limit 1
select `address1`, `country` from `addresses` where `id` = 11796 limit 1
---
    public function saveAddress(CustomerAddressForm $request)
    {

        log::info('saveAddress');
        $data = $request->all();

        if (
            !auth()->guard('customer')->check()
            && !Cart::getCart()->hasGuestCheckoutItems()
        ) {
            log::info('first');
            return response()->json(['redirect_url' => route('shop.customer.session.index')], 403);
        }

        $data['billing']['address1'] = implode(PHP_EOL, array_filter($data['billing']['address1']));
        $data['shipping']['address1'] = implode(PHP_EOL, array_filter($data['shipping']['address1']));
        if (isset($data['billing']['airport_name'])) {
            $data['billing']['airport_name'] = implode(PHP_EOL, array_filter($data['billing']['airport_name']));
            $airport_id = DB::table('delivery_location_airports')
                ->where('name', $data['billing']['airport_name'])
                ->value('id');
        }

        // sandeep add code for guest user add country and address1 data
        if(!auth()->guard('customer')->check()){
          $addressData =   DB::table('addresses')
                            ->where('id',$data['billing']['address_id'])
                            ->select('address1','country')->first();

update `cart` set `shipping_method` = 'free_free' where `id` = 3443
---
    public function saveOrder()
    {
        log::info('save order1');
        if (Cart::hasError()) {
            Log::info('cart errror');
            return response()->json(['redirect_url' => route('shop.checkout.cart.index')], 403);
        }

        log::info('save order2');

        Cart::collectTotals();

        $this->validateOrder();

        $cart = Cart::getCart();

        DB::table('cart')
            ->where('id', $cart->id)
            ->update([
                'shipping_method' => 'free_free'
            ]);