packages/ACME/CateringPackage/src/Http/Controllers/Shop/SignUpController.php



        } else {
            $token = DB::table('fbo_details')->pluck('customer_token')->toArray();
---
select `customer_token` from `fbo_details`




            $latestRecord = DB::table('fbo_details')
                ->where('customer_token', $customer_token)
                ->orderByDesc('id')
                ->first();

            if ($latestRecord) {
                // Update the latest record with the provided data
                DB::table('fbo_details')
                    ->where('id', $latestRecord->id)
                    ->update([
                        'full_name' => $request->fullname,
                        'phone_number' => $request->phonenumber,
                        'email_address' => $request->email,
                        'tail_number' => $request->tailnumber,
                        'packaging_section' => $request->packagingsection,
                        'service_packaging' => $request->servicepackaging,
                        'delivery_time' => $request->delivery_time,
                        'delivery_date' => $formattedDate,
                    ]);
---
select * from `fbo_details` where `customer_token` = 'k4abVK8PwWL0b0QzwCbDAHtyGbAAPkn5bMqDHCvq' order by `id` desc limit 1
update `fbo_details` set `full_name` = 'test tst', `phone_number` = '(098) 977-7675', `email_address` = 'ram@mindwebtree.com', `tail_number` = '4646', `packaging_section` = 'Microwave', `service_packaging` = 'Bulk Packaging', `delivery_time` = '8:30 PM', `delivery_date` = '2025-2-25' where `id` = 1011

                'delivery_time' => $request->delivery_time,
            ]);
        }else{
        DB::table('fbo_details')
            ->where('customer_token', $customer_token)
            ->orderBy('id', 'DESC')
            ->limit(1)
            ->update([
                'full_name' => $request->fullname,
                'phone_number' => $request->phonenumber,
                'email_address' => $request->email,
                'tail_number' => $request->tailnumber,
                'packaging_section' => $request->packagingsection,
                'service_packaging' => $request->servicepackaging,
                'delivery_date' => $formattedDate,
                'delivery_time' => $request->delivery_time,
            ]);
---
update `fbo_details` set `full_name` = 'test', `phone_number` = '(888) 888-8888', `email_address` = 'test@gmail.com', `tail_number` = '78988', `packaging_section` = 'Microwave', `service_packaging` = 'Bulk Packaging', `delivery_date` = '2025-2-25', `delivery_time` = '4:15 AM' where `customer_token` = 'SaIE1uA7yb0Sqt00aF7cmuL1bHaSHDmhwQtPqRt2' order by `id` desc limit 1